/*----------------------------------
        功能：返回两个数中最大值 
        参数：数字p1,p2 
        返回：最大值的一个数 
        示例：$.MaxNum(1,2); 
        /---------------------------*/  
;(function($) {  
    $.extend({  
        "MaxNum": function(p1, p2) {  
            return (p1 > p2) ? p1 : p2;  
        }  
    });  
})(jQuery);  

  
/*-------------------------------------/ 
功能：返回两个数中最小值 
参数：数字p1,p2 
返回：最小值的一个数 
示例：$.MinNum(1,2); 
/-------------------------------------*/  
; (function($) {  
    $.extend({  
        "MinNum": function(p1, p2) {  
            return (p1 > p2) ? p2 : p1;  
        }  
    });  
})(jQuery);  

/*-------------------------------------/ 
功能：startwith实现
参数： 原始字符串p1,前缀字符串p2
返回：true or false;
示例：$.MinNum(); 
/-------------------------------------*/  

(function($) {  
    $.extend({  
        "startWith": function(p1, p2) {  
            return (p1 > p2) ? p1 : p2;  
        }  
    });  
})(jQuery); 
/*-------------------------------------/ 
功能：endwith实现
参数： 原始字符串p1,后缀字符串p2
返回：true or false;
示例：$.endWith(); 
/-------------------------------------*/  

(function($) {  
    $.extend({  
        "endWith": function(p1, p2) {  
            return (p1 > p2) ? p1 : p2;  
        }  
    });  
})(jQuery); 

